# Titanic Data Analysis

## Introduction
**Purpose:** To performa data analysis on a sample Titanic dataset. 

This dataset contains demographics and passenger information from 891 of the 2224 passengers and crew on board the Titanic. You can view a description of this dataset on the Kaggle website, where the data was obtained (https://www.kaggle.com/c/titanic/data).

## Questions

"One of the reasons that the shipwreck led to such loss of life was that there were not enough lifeboats for the passengers and crew. Although there was some element of luck involved in surviving the sinking, some groups of people were more likely to survive than others, such as women, children, and the upper-class." -  https://www.kaggle.com/c/titanic

What factors made people more likely to survive?
1. **Were social-economic standing a factor in survival rate?**
2. **Did age, regardless of sex, determine your chances of survival?**
3. **Did women and children have preference to lifeboats (survival)?**
4. **Did women with children have a better survival rate vs women without children (adults 18+)?**

**Assumption:** We are going to assume that everyone who survived made it to a life boat and it wasn't by chance or luck.

## Data Wrangling

### Data Description

- **survival:** Survival (0 = No; 1 = Yes)
- **pclass:** Passenger Class (1 = 1st; 2 = 2nd; 3 = 3rd)
- **name:** Name
- **sex:** Sex
- **age:** Age
- **sibsp:** Number of Siblings/Spouses Aboard
- **parch:** Number of Parents/Children Aboard
- **ticket:** Ticket Number
- **fare:** Passenger Fare
- **cabin:** Cabin
- **embarked:** Port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)

**Special Notes:**
- Pclass is a proxy for socio-economic status (SES) 1st ~ Upper; 2nd ~ Middle; 3rd ~ Lower
- Age is in Years; Fractional if Age less than One (1) If the Age is Estimated, it is in the form xx.5

With respect to the family relation variables (i.e. sibsp and parch) some relations were ignored.  The following are the definitions used for sibsp and parch.

- **Sibling:**  Brother, Sister, Stepbrother, or Stepsister of Passenger Aboard Titanic
- **Spouse:**   Husband or Wife of Passenger Aboard Titanic (Mistresses and Fiances Ignored)
- **Parent:**   Mother or Father of Passenger Aboard Titanic
- **Child:**    Son, Daughter, Stepson, or Stepdaughter of Passenger Aboard Titanic

Other family relatives excluded from this study include cousins, nephews/nieces, aunts/uncles, and in-laws.  Some children travelled only with a nanny, therefore parch=0 for them.  As well, some travelled with very close friends or neighbors in a village, however, the definitions do not support such relations.

In [3]:
# Render plots inline
%matplotlib inline

# Import libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Set the filename variable and read in the dataset
data_file = 'titanic_data.csv'
titanic_data = pd.read_csv(data_file)

In [4]:
# Print the first few records review data and format
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [5]:
# Print the last few records review data and format
titanic_data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,NaN,Q

**Note:** Age can be NaN, ticket and cabin are alphanumeric and also missing values with NaN

**Additional Questions from reading data**
- How did children with nanny's compare fare in compariso to children with parents. Did the nanny "abandon" the child to save his/her own life?
 - I would need additional information to determine if a child was indeed only on board with a nanny. For example, a child could be on board with an adult sibling. This would make Parch (parent) = 0 but it would be incorrect to say the child had a nanny.
 - Need to review list for children with no siblings. These will be children with nannies. Potential **Q5**
- Did cabin location play a part in the survival rate without the consideration of class
 - No data on where the cabins are actually located on the Titanic

### Data Cleanup

From the data description and questions to answer, I've determined that some dataset columns will not play a part in my analysis and these columns can therefore be removed. This will decluster the dataset and also help with process performance of the dataset. 
- PassengerId
- Name
- Ticket
- Cabin

I'll take a 3 step process to data cleanup
1. Identify and remove any duplicate entries
2. Remove unnecessary columns
3. Fix missing and data format issues

#### Step 1 - Remove duplicate entries
Concluded that no duplicate entires exist, based on tests below

In [6]:
# Identify and remove duplicate entries
titanic_data_duplicates = titanic_data.duplicated()
print 'Number of duplicate entries is/are {}'.format(titanic_data_duplicates.sum())

Number of duplicate entries is/are 0

In [7]:
# Let us just make sure this is working
duplicate_test = titanic_data.duplicated('Age').head()
print 'Number of entries with duplicate age in top entires are {}'.format(duplicate_test.sum())
titanic_data.head()

Number of entries with duplicate age in top entires are 1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

#### Step 2 - Remove unnecessary columns
Columns (PassengerId, Name, Ticket, Cabin) removed

In [8]:
# Create new dataset with unwanted columns
titanic_data_cleansed = titanic_data.drop(['PassengerId','Name','Ticket','Cabin'], axis=1)
titanic_data_cleansed.head()

   Survived  Pclass     Sex  Age  SibSp  Parch     Fare Embarked
0         0       3    male   22      1      0   7.2500        S
1         1       1  female   38      1      0  71.2833        C
2         1       3  female   26      0      0   7.9250        S
3         1       1  female   35      1      0  53.1000        S
4         0       3    male   35      0      0   8.0500        S

#### Step 3 - Fix any missing or data format issues

In [46]:
# Calculate number of missing values
titanic_data_cleansed.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [53]:
# Review some of the missing Age data
missing_age_bool = pd.isnull(titanic_data_cleansed['Age'])
titanic_data_cleansed[missing_age_bool].head()

    Survived  Pclass     Sex  Age  SibSp  Parch     Fare Embarked
5          0       3    male  NaN      0      0   8.4583        Q
17         1       2    male  NaN      0      0  13.0000        S
19         1       3  female  NaN      0      0   7.2250        C
26         0       3    male  NaN      0      0   7.2250        C
28         1       3  female  NaN      0      0   7.8792        Q

In [64]:
# Determine number of males and females with missing age values
print 'Number for females and males with age missing are {} and {} respectively'.format(
(titanic_data_cleansed[missing_age_bool]['Sex'] == 'female').sum(),
(titanic_data_cleansed[missing_age_bool]['Sex'] == 'male').sum())

Number for females and males with age missing are 53 and 124 respectively

In [69]:
# Taking a look at the datatypes
titanic_data_cleansed.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 8 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null object
Age         714 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Embarked    889 non-null object
dtypes: float64(2), int64(4), object(2)
memory usage: 62.6+ KB

In [72]:
# Update Sex and Embarked to be str instead of object datatypes - Is this necessary for analysis???

Missing Embarked data for 2 entries shouldn't be an issue.

Missing Age data will affect **Q2 - Did age, regardless of sex, determine your chances of survival?** But graphing and summations shouldn't be a problem since they will be treated as zero value. However, 177 is roughly 20% of our 891 sample dataset which seems like a lot to discount. Also, this needs to be accounted for if reviewing descriptive stats such as mean age. 

Should keep note of the proportions across male and female...

- Age missing in male data: **124**
- Age missing in female data: **53**

## Data Exploration and Visualization

In [91]:
# Looking at some typical descriptive statistics
titanic_data_cleansed.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [100]:
# Age min at 0.42 looks a bit weird so give a closer look
titanic_data_cleansed[titanic_data_cleansed['Age'] < 1]

     Survived  Pclass     Sex   Age  SibSp  Parch      Fare Embarked
78          1       2    male  0.83      0      2   29.0000        S
305         1       1    male  0.92      1      2  151.5500        S
469         1       3  female  0.75      2      1   19.2583        C
644         1       3  female  0.75      2      1   19.2583        C
755         1       2    male  0.67      1      1   14.5000        S
803         1       3    male  0.42      0      1    8.5167        C
831         1       2    male  0.83      1      1   18.7500        S

In [122]:
print 'Youngest to survive: {} \nYoungest to die: {} \nOldest to survive: {} \nOldest to die: {}'.format(
titanic_data_cleansed[titanic_data_cleansed['Survived'] == True]['Age'].min(),
titanic_data_cleansed[titanic_data_cleansed['Survived'] == False]['Age'].min(),
titanic_data_cleansed[titanic_data_cleansed['Survived'] == True]['Age'].max(),
titanic_data_cleansed[titanic_data_cleansed['Survived'] == False]['Age'].max())

Youngest to survive: 0.42
Youngest to die: 1.0
Oldest to survive: 80.0
Oldest to die: 74.0

Data description does mention that Age can be fractional - *Age is in Years; Fractional if Age less than One (1) If the Age is Estimated, it is in the form xx.5* - This data looks okay

**Note:** An interesting note is that all "new borns" survived potential **Q6** - At what age did children's survival rate match that of adults 

Other notable stats
- Oldest to survive: **80**
- Oldest to die: **74**
- Youngest to survive: **< 1 (0.42)**
- Youngest to die: **1**

**TODO: add the number of women and men**

## Question 1
Were social-economic standing a factor in survival rate?

In [267]:
# Group data by class (social economical standing) and then by survival
# Find the totals per group
groupedby_class_survived = titanic_data_cleansed.groupby(['Pclass','Survived'])
groupedby_class_survived_size = groupedby_class_survived.size().astype('float')
print groupedby_class_survived_size

# Determine percentage of survival by class
class_one_survived_pct = \
((groupedby_class_survived_size[1,1] / groupedby_class_survived_size[1].sum()) * 100).round(2)
class_two_survived_pct = \
((groupedby_class_survived_size[2,1] / groupedby_class_survived_size[2].sum()) * 100).round(2)
class_three_survived_pct = \
((groupedby_class_survived_size[3,1] / groupedby_class_survived_size[3].sum()) * 100).round(2)

print 'Percentage of passengers (per "social economical" class) who survived \nClass 1: {}%\nClass 2: {}%\nClass 3: {}%' \
.format(class_one_survived_pct, class_two_survived_pct, class_three_survived_pct)

Pclass  Survived
1       0            80
        1           136
2       0            97
        1            87
3       0           372
        1           119
dtype: float64
Percentage of passengers (per "social economical" class) who survived
Class 1: 62.96%
Class 2: 47.28%
Class 3: 24.24%

Based on the raw numbers it would appear as though passengers in Class 3 had a similar survival rate as those from Class 1 with 119 and 136 passengers surviving respectively. However, looking at the percentages of the overall passengers per class, it can be assumed that a passenger from Class 1 is about 2.5x times more likely to survive than those in Class 3. 

Social-economic standing was a factor in survival rate of passengers.

- Class 1: **62.96%**
- Class 2: **47.28%**
- Class 3: **24.24%**

## Question 2
Did age, regardless of sex, determine your chances of survival?

## Question 3
Did women and children have preference to lifeboats (survival)?

## Question 4
Did women with children have a better survival rate vs women without children (adults 18+)?

## Question 5
How did children with nanny's compare fare in compariso to children with parents. Did the nanny "abandon" the child to save his/her own life?
 - Need to review list for children with no siblings. These will be children with nannies. Potential Q5

## Question 6
At what age did children's survival rate match that of adults?

## Conclusion

## References

- https://www.kaggle.com/c/titanic/data
- http://nbviewer.jupyter.org/github/jvns/pandas-cookbook/tree/master/cookbook/